{
    "title": "Проекты",
    "description": "Здесь собраны проекты в сферах автоматизации, работы с клиентами и просто для души. Используй фильтры, чтобы найти интересное.",
    "categories": {
      "all": "Все",
      "featured": "Избранное",
      "automation": "Автоматизация и боты",
      "webapp": "Веб-приложения",
      "client": "Работа с клиентами",
      "civic": "Гражданские / социальные",
      "fun": "Просто ради фана"
    },
    "darcon_desc": "Калькулятор даркона для новых репатриантов в Израиле. Позволяет рассчитать, имеете ли вы право на израильский паспорт сроком на 5 или 10 лет, исходя из даты репатриации и времени, проведённого за границей. Учитываются официальные правила МВД, и калькулятор показывает, сколько месяцев осталось, а также даёт понятное объяснение. Пока доступен только на русском, но вскоре появятся версии на английском и украинском языках.",
    "hr_bot_desc": "CRM-система на базе Telegram для автоматизации массового подбора персонала для корпоративных клиентов и рекрутинговых агентств. Полностью разработана мной (Python + aiogram), включает блоки перевода. Позволяет связывать HR и рекрутеров, кандидатам — просматривать вакансии и откликаться с резюме, а рекрутерам — рекомендовать кандидатов и получать бонусы, если их рефералы наняты.",
    "diagnostic_desc": "Телеграм-бот, который выполняет функцию помощника для определения потребностей заказчика. Разработан полностью с нуля: сценарии, логика, GPT-интеграция и интерфейс. На основе ответов пользователя бот подбирает оптимальное AI-решение.",
    "nekudot_desc": "Многоязычный React-калькулятор, созданный для репатриантов. Помогает рассчитать налоговые льготы (נקודות זיכוי) по официальной формуле. Полностью разработан мной, с поддержкой 5 языков через i18n.",
    "aiba_desc": "Многоязычный сайт стартапа, занимающегося автоматизацией бизнес-процессов через ботов. Выполнил полный цикл: дизайн, архитектура, разработка (React + Vite), мультиязычность через i18n.",
    "audiohebbot_desc": "Телеграм-бот на Python, который распознаёт голосовые и аудиосообщения на иврите и переводит их в текст. Использует `speech_recognition`, `aiogram`, `pydub`. Поддерживает Telegram voice/audio и ведёт статистику использования.",
    "ozon_league_desc": "Разработка лендинга и со-участие в создании обучающей программы по переговорам (лига переговорщиков). Задачи включали UI/UX-дизайн, фронтенд и поддержку контента.",
    "ozon_kam_desc": "Образовательная платформа для аккаунт-менеджеров Ozon. Участвовал в создании структуры курса и разработке лендинга. Отвечал за UI и адаптацию материалов.",
    "ozon_lead_desc": "Программа для обучения руководителей в корпоративной системе Ozon. Работал над дизайном и фронтенд-частью платформы, адаптируя контент под целевую аудиторию.",
    "equitech_desc": "Сайт акселератора Equitech. Работал с готовым проектом на Wix, отвечал за фронтенд-поддержку, внесение изменений и обновление визуального контента.",
    "fintech_desc": "Сайт FinTech Aviv — главного финтех-сообщества Израиля. Поддерживал и дорабатывал существующий сайт на Wix: визуальные правки, обновление секций и UI-улучшения.",
    "color_desk_desc": "Цветовая панель с динамической анимацией. При наведении квадраты меняют цвет — интерактивный UI-компонент, реализованный для экспериментов с визуальными эффектами.",
    "aim_game_desc": "Мини-игра на чистом JS для тренировки реакции и меткости. Включает систему очков, переменные тайминги и динамическое появление целей.",
    "slider_desc": "Кастомный анимированный слайдер с управлением с клавиатуры. Разработан без библиотек, с полной поддержкой переходов и кастомной логикой отображения контента.",
    "trello_desc": "Фронтенд-пример доски задач с drag-n-drop в стиле Trello. Демонстрирует навыки работы с интерактивным интерфейсом и структурой задач.",
    "postcards_desc": "Галерея анимированных цифровых открыток в минималистичном дизайне. Реализована полностью вручную — от анимации до отображения и навигации.",
    "aspect_ratio_desc": "Простой калькулятор для расчёта соотношений сторон изображений и видео. Позволяет быстро определить правильные пропорции.",
    "color_parrot_desc": "Интерактивный учебный проект — попугай, которого можно раскрасить с помощью CSS-фильтров. Демонстрирует работу с фильтрами и кастомизацией SVG/изображений.",
    "drumkit_desc": "Учебный проект — виртуальная ударная установка, управляемая с клавиатуры. При нажатии воспроизводятся звуки с визуальной обратной связью."
  }
  