{
  "title": "Projects",
  "description": "Infrastructure projects and automation solutions",
  "categories": {
    "all": "All",
    "featured": "Featured",
    "devops": "DevOps",
    "infrastructure": "Infrastructure",
    "automation": "Automation",
    "webapp": "Web Apps",
    "client": "Client Work",
    "civic": "Public Tools",
    "fun": "Fun Projects"
  },
  "airplane_tracker_desc": "Real-time airplane tracking system with microservices architecture. Python, FastAPI, React, Docker, Redis, GitHub Actions, Nginx. Zero-downtime deployment with custom tracking algorithm.",
  "ai_voice_desc": "AI-powered voice training simulator with real-time STT/TTS. Python, Node.js, Flask, OpenAI GPT-4, Whisper, ElevenLabs, Runpod GPU. Sub-3-second response time, 30+ users tested.",
  "devops_provisioning_desc": "Infrastructure provisioning tool with OOP architecture. Python, Pydantic, Bash, subprocess, Git. Idempotent scripts, JSON configs, dual logging system.",
  "home_infrastructure_desc": "24/7 home automation system with remote monitoring. Python, Flask, Telegram Bot, Tailscale VPN, AdGuard Home, Raspberry Pi. WOL, VPN mesh network.",
  "darcon_desc": "Darcon calculator for new immigrants in Israel. Allows you to estimate your eligibility for a 5- or 10-year Israeli passport based on your Aliyah date and time spent abroad. Official Ministry of Interior rules are taken into account, and the calculator shows how many months remain and provides a clear explanation. Currently available only in Russian, with English and Ukrainian versions coming soon.",
  "hr_bot_desc": "A Telegram-based CRM system for automating high-volume hiring for corporate clients and recruiting agencies. Fully developed by me (Python + aiogram), with multilingual support. Connects HR managers with recruiters, allows candidates to view and apply to jobs, and enables recruiters to refer candidates and earn bonuses if their referrals are hired.",
  "diagnostic_desc": "A Telegram bot that acts as a virtual assistant to identify client needs. Fully developed from scratch: GPT logic, interface, and dialogue flow. It selects the optimal AI solution based on user responses.",
  "nekudot_desc": "A multilingual React-based calculator designed for new immigrants. Helps calculate tax credit points (נקודות זיכוי) using the official formula. Fully developed by me, with support for 5 languages via i18n.",
  "aiba_desc": "Multilingual website for a startup that automates business processes using bots. I handled everything: design, architecture, development (React + Vite), and i18n integration.",
  "audiohebbot_desc": "A Telegram bot in Python that transcribes Hebrew voice and audio messages into text. Uses `speech_recognition`, `aiogram`, and `pydub`. Supports Telegram voice/audio files and tracks usage stats.",
  "ozon_league_desc": "Landing page development and co-creation of a negotiation training program ('Negotiators League'). Responsible for UI/UX design, frontend, and content support.",
  "ozon_kam_desc": "Educational platform for Ozon's key account managers. Contributed to course structure and landing page development. Responsible for UI and content adaptation.",
  "ozon_lead_desc": "Leadership training program for managers at all levels in Ozon. Worked on the platform’s UI design and frontend, tailoring content to the target audience.",
  "equitech_desc": "Website for the Equitech accelerator. Supported and updated the existing Wix-based frontend, including visual changes and content improvements.",
  "fintech_desc": "Official website of FinTech Aviv — Israel’s main FinTech community. Maintained and enhanced the Wix-based frontend: visual improvements, content updates, and UI refinements.",
  "color_desk_desc": "A color panel with dynamic animation. On hover, squares change colors — an interactive UI experiment in visual feedback.",
  "aim_game_desc": "A mini-game built in vanilla JS to train reaction time and precision. Features a score system, timing variations, and target generation.",
  "slider_desc": "A custom animated slider with keyboard navigation. Built without libraries, with full support for transitions and custom logic.",
  "trello_desc": "Frontend example of a drag-and-drop task board in the Trello style. Demonstrates my skills with interactive interfaces and task structures.",
  "postcards_desc": "A minimalist gallery of animated digital postcards. Fully handcrafted — from animation to layout and interaction.",
  "aspect_ratio_desc": "A simple calculator for determining aspect ratios of images and videos. Helps quickly get correct proportions.",
  "color_parrot_desc": "An interactive learning project — a parrot you can recolor using CSS filters. Demonstrates SVG/image manipulation and UI effects.",
  "drumkit_desc": "A beginner-friendly drum kit project controlled by keyboard. Pressing keys triggers sound effects with visual feedback."
}
