{
  "title": "פרויקטים",
  "description": "פרויקטי תשתית ופתרונות אוטומציה",
  "categories": {
    "all": "הכל",
    "featured": "מומלצים",
    "devops": "DevOps",
    "infrastructure": "תשתית",
    "automation": "אוטומציה",
    "webapp": "אפליקציות ווב",
    "client": "פרויקטי לקוחות",
    "civic": "כלים ציבוריים",
    "fun": "פרויקטי לימוד"
  },
  "airplane_tracker_desc": "מערכת מעקב אחר מטוסים בזמן אמת עם ארכיטקטורת microservices. Python, FastAPI, React, Docker, Redis, GitHub Actions, Nginx. פריסה ללא השבתה עם אלגוריתם מעקב מותאם אישית.",
  "ai_voice_desc": "סימולטור אימוני קול מבוסס AI עם STT/TTS בזמן אמת. Python, Node.js, Flask, OpenAI GPT-4, Whisper, ElevenLabs, Runpod GPU. זמן תגובה מתחת ל-3 שניות, 30+ משתמשים נבדקו.",
  "devops_provisioning_desc": "כלי provisioning של תשתית עם ארכיטקטורת OOP. Python, Pydantic, Bash, subprocess, Git. סקריפטים idempotent, קונפיגורציות JSON, מערכת logging כפולה.",
  "home_infrastructure_desc": "מערכת אוטומציה ביתית 24/7 עם ניטור מרחוק. Python, Flask, Telegram Bot, Tailscale VPN, AdGuard Home, Raspberry Pi. WOL, רשת VPN mesh.",
  "darcon_desc": "מחשבון דרכון לעולים חדשים בישראל. מאפשר לבדוק זכאות לדרכון ישראלי לתקופה של 5 או 10 שנים, לפי תאריך העלייה ותקופות השהייה מחוץ לישראל. מתחשב בכללי משרד הפנים, ומציג כמה חודשים נותרו עד לקבלת הדרכון, לצד הסבר ברור. כרגע זמין רק ברוסית, ובקרוב יתורגמו גם לאנגלית ואוקראינית.",
  "hr_bot_desc": "מערכת CRM מבוססת טלגרם לאוטומציה של גיוס עובדים בהיקף רחב עבור לקוחות עסקיים וסוכנויות השמה. פותחה כולה על-ידי (Python + aiogram) עם תמיכה בריבוי שפות. מאפשרת חיבור בין מגייסים לרכזי גיוס, מציג משרות למועמדים ומאפשר שליחת קורות חיים. מגייסים יכולים להמליץ על מועמדים ולקבל בונוס אם הם מתקבלים לעבודה.",
  "diagnostic_desc": "בוט טלגרם שמשמש כעוזר וירטואלי לזיהוי צרכי הלקוח. פותח במלואו מאפס: לוגיקת GPT, ממשק, ותסריטי שיחה. הבוט בוחר את הפתרון האופטימלי לפי תשובות המשתמש.",
  "nekudot_desc": "מחשבון רב-לשוני שנבנה ב-React עבור עולים חדשים. עוזר לחשב נקודות זיכוי במס הכנסה לפי הנוסחה הרשמית. פותח כולו על-ידי, עם תמיכה ב-5 שפות דרך i18n.",
  "aiba_desc": "אתר רב-לשוני לסטארט-אפ שמבצע אוטומציות עסקיות עם בוטים. עיצבתי, תכננתי ופיתחתי את כולו (React + Vite), כולל התממשקות ל-i18n.",
  "audiohebbot_desc": "בוט טלגרם ב-Python שממיר הודעות קוליות ואודיו לעברית לטקסט. מבוסס על `speech_recognition`, `aiogram` ו-`pydub`. תומך בקבצי קול טלגרם ומנהל סטטיסטיקות שימוש.",
  "ozon_league_desc": "פיתוח עמוד נחיתה ושותפות ביצירת תוכנית ללימוד מיומנויות משא ומתן (ליגת המתווכחים). הייתי אחראי על עיצוב UI/UX, פרונטאנד ותמיכה בתוכן.",
  "ozon_kam_desc": "פלטפורמה לימודית למנהלי לקוחות ב-Ozon. השתתפתי בבניית מבנה הקורס ובפיתוח עמוד הנחיתה. הייתי אחראי על ממשק המשתמש והתאמת התכנים.",
  "ozon_lead_desc": "תוכנית הכשרה למנהלים בדרגים שונים ב-Ozon. עבדתי על ממשק המשתמש והפרונטאנד של הפלטפורמה, והתאמתי את התוכן לקהל היעד.",
  "equitech_desc": "אתר של מאיץ Equitech. טיפלתי בפרונטאנד הקיים שנבנה על Wix — ביצעתי שינויים ויזואליים ושיפורי תוכן.",
  "fintech_desc": "האתר הרשמי של FinTech Aviv — קהילת הפינטק המרכזית בישראל. תמכתי ושיפרתי את האתר הקיים ב-Wix: עדכונים ויזואליים, שדרוגי UI ותוכן.",
  "color_desk_desc": "לוח צבעים עם אנימציה דינמית. בעת ריחוף, הריבועים משנים צבע — רכיב UI אינטראקטיבי לניסויים חזותיים.",
  "aim_game_desc": "מיני-משחק ב-JavaScript שמאמן תגובה ודיוק. כולל ניקוד, זמני תגובה משתנים והופעת מטרות.",
  "slider_desc": "סליידר מונפש עם ניווט דרך מקלדת. נבנה עם לוגיקה מותאמת אישית וללא ספריות.",
  "trello_desc": "דוגמה לפרונטאנד של לוח משימות עם גרירה בסגנון Trello. מציג יכולות אינטראקטיביות ומבנה משימות.",
  "postcards_desc": "גלריה מינימליסטית של גלויות מונפשות. הכל נבנה בעבודת יד — מהאנימציה ועד התצוגה.",
  "aspect_ratio_desc": "מחשבון פשוט לחישוב יחס גובה-רוחב של תמונות וסרטונים. מספק פרופורציות מדויקות במהירות.",
  "color_parrot_desc": "פרויקט לימודי אינטראקטיבי — תוכי שניתן לצבוע באמצעות מסנני CSS. מדגים מניפולציה של SVG/תמונות ואפקטים ויזואליים.",
  "drumkit_desc": "פרויקט לימודי של מערכת תופים וירטואלית הנשלטת מהמקלדת. לחיצה על מקש משמיעה צליל עם פידבק חזותי."
}
